Show / Hide Table of Contents
Class ListOfResultOfMember
List of result of member
Inheritance
System.Object
System.Collections.Generic.List<ResultOnMember>
ListOfResultOfMember
Implements
System.Collections.Generic.IList<ResultOnMember>
System.Collections.Generic.ICollection<ResultOnMember>
System.Collections.IList
System.Collections.ICollection
System.Collections.Generic.IReadOnlyList<ResultOnMember>
System.Collections.Generic.IReadOnlyCollection<ResultOnMember>
System.Collections.Generic.IEnumerable<ResultOnMember>
System.Collections.IEnumerable
Inherited Members
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.get_Item(System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.set_Item(System.Int32, System.Object)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Add(IdeaRS.OpenModel.Result.ResultOnMember)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.Add(System.Object)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.AddRange(System.Collections.Generic.IEnumerable<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.AsReadOnly()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.BinarySearch(System.Int32, System.Int32, IdeaRS.OpenModel.Result.ResultOnMember, System.Collections.Generic.IComparer<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.BinarySearch(IdeaRS.OpenModel.Result.ResultOnMember)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.BinarySearch(IdeaRS.OpenModel.Result.ResultOnMember, System.Collections.Generic.IComparer<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Clear()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Contains(IdeaRS.OpenModel.Result.ResultOnMember)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.Contains(System.Object)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.ConvertAll<TOutput>(System.Converter<IdeaRS.OpenModel.Result.ResultOnMember, TOutput>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.CopyTo(IdeaRS.OpenModel.Result.ResultOnMember[])
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.ICollection.CopyTo(System.Array, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.CopyTo(System.Int32, IdeaRS.OpenModel.Result.ResultOnMember[], System.Int32, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.CopyTo(IdeaRS.OpenModel.Result.ResultOnMember[], System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Exists(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Find(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindAll(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindIndex(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindIndex(System.Int32, System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindIndex(System.Int32, System.Int32, System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindLast(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindLastIndex(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindLastIndex(System.Int32, System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.FindLastIndex(System.Int32, System.Int32, System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.ForEach(System.Action<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.GetEnumerator()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.Generic.IEnumerable<IdeaRS.OpenModel.Result.ResultOnMember>.GetEnumerator()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IEnumerable.GetEnumerator()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.GetRange(System.Int32, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.IndexOf(IdeaRS.OpenModel.Result.ResultOnMember)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.IndexOf(System.Object)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.IndexOf(IdeaRS.OpenModel.Result.ResultOnMember, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.IndexOf(IdeaRS.OpenModel.Result.ResultOnMember, System.Int32, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Insert(System.Int32, IdeaRS.OpenModel.Result.ResultOnMember)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.Insert(System.Int32, System.Object)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.InsertRange(System.Int32, System.Collections.Generic.IEnumerable<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.LastIndexOf(IdeaRS.OpenModel.Result.ResultOnMember)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.LastIndexOf(IdeaRS.OpenModel.Result.ResultOnMember, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.LastIndexOf(IdeaRS.OpenModel.Result.ResultOnMember, System.Int32, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Remove(IdeaRS.OpenModel.Result.ResultOnMember)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.Remove(System.Object)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.RemoveAll(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.RemoveAt(System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.RemoveRange(System.Int32, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Reverse()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Reverse(System.Int32, System.Int32)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Sort()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Sort(System.Collections.Generic.IComparer<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Sort(System.Int32, System.Int32, System.Collections.Generic.IComparer<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Sort(System.Comparison<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.ToArray()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.TrimExcess()
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.TrueForAll(System.Predicate<IdeaRS.OpenModel.Result.ResultOnMember>)
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Capacity
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Count
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.IsFixedSize
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.Generic.ICollection<IdeaRS.OpenModel.Result.ResultOnMember>.IsReadOnly
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.IsReadOnly
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.ICollection.IsSynchronized
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.ICollection.SyncRoot
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.Item[System.Int32]
 System.Collections.Generic.List<IdeaRS.OpenModel.Result.ResultOnMember>.System.Collections.IList.Item[System.Int32]
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obsolete]
public class ListOfResultOfMember : List<ResultOnMember>, IList<ResultOnMember>, ICollection<ResultOnMember>, IList, ICollection, IReadOnlyList<ResultOnMember>, IReadOnlyCollection<ResultOnMember>, IEnumerable<ResultOnMember>, IEnumerable
Methods
Improve this Doc   View Source
GetSchema()
Gets schema
Declaration
public XmlSchema GetSchema()
Returns
 Type |  Description
 System.Xml.Schema.XmlSchema
Improve this Doc   View Source
ReadXml(XmlReader)
Reads XML
Declaration
public void ReadXml(XmlReader reader)
Parameters
 Type |  Name |  Description
 System.Xml.XmlReader |  reader
XML reader
Improve this Doc   View Source
WriteXml(XmlWriter)
Writes XML
Declaration
public void WriteXml(XmlWriter writer)
Parameters
 Type |  Name |  Description
 System.Xml.XmlWriter |  writer
XML writer
Implements
 System.Collections.Generic.IList<T>
 System.Collections.Generic.ICollection<T>
 System.Collections.IList
 System.Collections.ICollection
 System.Collections.Generic.IReadOnlyList<T>
 System.Collections.Generic.IReadOnlyCollection<T>
 System.Collections.Generic.IEnumerable<T>
 System.Collections.IEnumerable
 Improve this Doc
 View Source